Reports/А_ОтчетPL.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Report>
		<Properties>
			<Name>А_ОтчетPL</Name>
		</Properties>
	</Report>
</MetaDataObject>

AccumulationRegisters/ПрочиеРасходы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<AccumulationRegister>
		<Properties>
			<Name>ПрочиеРасходы</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаБезНДС</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаРегл</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаРеглБезНДС</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НДСРегл</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПостояннаяРазница</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВременнаяРазница</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаУпр</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаУпрБезНДС</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ХозяйственнаяОперация</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ХозяйственныеОперации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АналитикаУчетаНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлючиАналитикиУчетаНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетКт</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаПрочихАктивов</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументДвижения</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.РаспределениеПрочихЗатрат</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КорСтатьяРасходов</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.СтатьиРасходов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КорОрганизация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоляСтоимости</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>5</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КорПодразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КорАналитикаРасходов</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.СтатьиРасходов</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГруппаПродукции</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГруппыАналитическогоУчетаНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КорСтатьяКалькуляции</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиКалькуляции</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РасчетСебестоимости</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РасчетПартий</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторСтроки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КорНаправлениеДеятельности</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НаправленияДеятельности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьИсточникДвижений</Name>
					<Type>
						<v8:Type>cfg:EnumRef.УдалитьИсточникиДвижений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КорОбъектУчетаРезервов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОбъектыУчетаРезервовПредстоящихРасходов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КорВидРезервов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Резервы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидИсточника</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыИсточниковДвижений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НастройкаХозяйственнойОперации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НастройкиХозяйственныхОпераций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторФинЗаписи</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>А_ФизическоеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НаправлениеДеятельности</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НаправленияДеятельности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НалоговоеНазначение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НалоговыеНазначенияАктивовИЗатрат</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтатьяРасходов</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.СтатьиРасходов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>АналитикаРасходов</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.СтатьиРасходов</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ФормаPL</Name>
					<Type>
						<v8:Type>cfg:EnumRef.А_ФормыPL</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

AccumulationRegisters/ПрочиеДоходы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<AccumulationRegister>
		<Properties>
			<Name>ПрочиеДоходы</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаРегл</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаУпр</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаРеглБезНДС</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаУпрБезНДС</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ХозяйственнаяОперация</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ХозяйственныеОперации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьСуммаРегл</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РасчетСебестоимости</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КорНаправлениеДеятельности</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НаправленияДеятельности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НастройкаХозяйственнойОперации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НастройкиХозяйственныхОпераций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторФинЗаписи</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НаправлениеДеятельности</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НаправленияДеятельности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтатьяДоходов</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.СтатьиДоходов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>АналитикаДоходов</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.СтатьиДоходов</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ФормаPL</Name>
					<Type>
						<v8:Type>cfg:EnumRef.А_ФормыPL</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

AccumulationRegisters/А_ДвиженияДенегИзКазны.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<AccumulationRegister>
		<Properties>
			<Name>А_ДвиженияДенегИзКазны</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>UIDРегистратораКазны</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекстДокументаКазны</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>БанковскийСчетКасса</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчетаОрганизаций</v8:Type>
						<v8:Type>cfg:CatalogRef.Кассы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>А_ОрганизацияБухгалтерия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипДенежныхСредств</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыДенежныхСредств</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтатьяДвиженияДенежныхСредств</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиДвиженияДенежныхСредств</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПодразделениеКазна</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НаправлениеДеятельностиКазна</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НаправленияДеятельности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДокументДвиженияКазны</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.А_ПриходДенегОтФинАгента</v8:Type>
						<v8:Type>cfg:DocumentRef.РасходныйКассовыйОрдер</v8:Type>
						<v8:Type>cfg:DocumentRef.А_ПереносДвиженийИзКазны</v8:Type>
						<v8:Type>cfg:DocumentRef.ПриходныйКассовыйОрдер</v8:Type>
						<v8:Type>cfg:DocumentRef.СписаниеБезналичныхДенежныхСредств</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеБезналичныхДенежныхСредств</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Enums/А_ФормыPL.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Enum>
		<Properties>
			<Name>А_ФормыPL</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Форма1</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Форма2</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Reports/А_ОтчетPL/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;
	УстановитьПривилегированныйРежим(Истина);

	// Берём только период — отбор по Организации/Подразделению делает сама СКД на готовом наборе.
	ПараметрПериод = КомпоновкаДанныхКлиентСервер.ПолучитьПараметр(КомпоновщикНастроек, "Период").Значение;
	НачалоПериода = НачалоДня(ПараметрПериод.ДатаНачала);
	КонецПериода = КонецДня(ПараметрПериод.ДатаОкончания);

	ПараметрВД = КомпоновкаДанныхКлиентСервер.ПолучитьПараметр(КомпоновщикНастроек, "ВключатьДочерние");
	ВключатьДочерние = ?(ПараметрВД <> Неопределено, ПараметрВД.Значение, Ложь);

	// 3 окремі Boolean-параметри для фільтра розділів (default = усі Истина — поточна поведінка).
	П_PL    = КомпоновкаДанныхКлиентСервер.ПолучитьПараметр(КомпоновщикНастроек, "ПоказPL");
	П_ЕРП   = КомпоновкаДанныхКлиентСервер.ПолучитьПараметр(КомпоновщикНастроек, "ПоказЕРП");
	П_Казна = КомпоновкаДанныхКлиентСервер.ПолучитьПараметр(КомпоновщикНастроек, "ПоказКазна");
	ПоказPL    = ?(П_PL    <> Неопределено, П_PL.Значение,    Истина);
	ПоказЕРП   = ?(П_ЕРП   <> Неопределено, П_ЕРП.Значение,   Истина);
	ПоказКазна = ?(П_Казна <> Неопределено, П_Казна.Значение, Истина);

	ТаблицаДанных = ПолучитьОбъединенныеДанные(НачалоПериода, КонецПериода, ВключатьДочерние,
		ПоказPL, ПоказЕРП, ПоказКазна);

	// Аналитика1 (строка) — представление аналитики для группировки в СКД.
	// Логика по требованию финансиста (2026-05-21):
	//   - для ЕРП/Каса-строк (СуммаЕРП<>0 или СуммаКазны<>0) — СокрЛП(Аналитика)
	//   - для PL-строк (Ф1/Ф2/PL) — СокрЛП(Комментарий) (обрезанный до 1000 символов в SQL)
	Если ТаблицаДанных.Колонки.Найти("Аналитика1") = Неопределено Тогда
		ТаблицаДанных.Колонки.Добавить("Аналитика1", Новый ОписаниеТипов("Строка"));
	КонецЕсли;
	Для Каждого Стр Из ТаблицаДанных Цикл
		Если Стр.СуммаЕРП <> 0
			ИЛИ Стр.СуммаДДСизКазныРасход <> 0
			ИЛИ Стр.СуммаДДСизКазныПриход <> 0 Тогда
			Стр.Аналитика1 = СокрЛП(Строка(Стр.Аналитика));
		Иначе
			Стр.Аналитика1 = СокрЛП(Строка(Стр.Комментарий));
		КонецЕсли;
	КонецЦикла;

	ВнешниеНаборыДанных = Новый Структура("Данные", ТаблицаДанных);

	НастройкиОтчета = КомпоновщикНастроек.ПолучитьНастройки();
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, НастройкиОтчета, ДанныеРасшифровки);

	ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновки.Инициализировать(МакетКомпоновки, ВнешниеНаборыДанных, ДанныеРасшифровки);

	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	ПроцессорВывода.УстановитьДокумент(ДокументРезультат);
	ПроцессорВывода.Вывести(ПроцессорКомпоновки);

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Возвращает ссылку на ДДС, у которой установлен флаг А_ПриёмникСебестоимостиПродажPL.
// Если такой нет — возвращает ПустаяСсылка (тогда CoGS не появляется в отчёте).
//
// Используется для маркировки "Приёмника CoGS" — финансист ставит флаг на одной ДДС,
// и вся себестоимость продаж за период вешается на ту PL-статью, в ТЧ Статьи которой
// добавлена эта ДДС.
//
Функция ПолучитьДДСПриёмникCoGS()

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	Ссылка
	|ИЗ
	|	Справочник.СтатьиДвиженияДенежныхСредств
	|ГДЕ
	|	А_ПриёмникСебестоимостиПродажPL
	|	И НЕ ПометкаУдаления";

	Рез = Запрос.Выполнить().Выгрузить();
	Если Рез.Количество() = 0 Тогда
		Возврат Справочники.СтатьиДвиженияДенежныхСредств.ПустаяСсылка();
	КонецЕсли;

	Возврат Рез[0].Ссылка;

КонецФункции

// Собираем ВСЁ за период без серверной фильтрации по Организации/Подразделению —
// финальный отбор делает СКД через настройки варианта.
//
// АРХИТЕКТУРА ИСТОЧНИКОВ (после доработки 2026-04-25):
//   PL     — Документ.А_ОтчетPL.ДанныеОтчета
//   ЕРП Дх — РегистрНакопления.ВыручкаИСебестоимостьПродаж (Виручка з Реалізацій,
//            СтатьяДоходов хардкодом = "ВыручкаОтПродаж")
//          + РегистрНакопления.ПрочиеДоходы (інші доходи: Курсові, ФінДіяльність)
//   ЕРП Рх — РегистрНакопления.ПрочиеРасходы (ВСЕ расходы, первичный регистр)
//            включая ЗП (из документа ОтражениеЗарплатыВФинансовомУчете),
//            амортизацию, аренду, материалы, услуги и т.д.
//   ЕРП CoGS — РегистрНакопления.ВыручкаИСебестоимостьПродаж (СтоимостьУпрБезНДС),
//              ДДС = маркер з Справочник.СтатьиДвиженияДенежныхСредств.А_ПриёмникСебестоимостиПродажPL.
//
// Перехід Виручки з ФинансовыеРезультаты на ВыручкаИСебестоимостьПродаж зроблено
// 2026-04-25: ФР писалося документом РасчетСебестоимостиТоваров (закриваюча
// агрегація — 56.9M з 63M Виручки), що ламало drill-down. ВиР пише тільки Реалізації.
//
Функция ПолучитьОбъединенныеДанные(НачалоПериода, КонецПериода, ВключатьДочерние = Ложь,
	ПоказPL = Истина, ПоказЕРП = Истина, ПоказКазна = Истина) Экспорт

	Запрос = Новый Запрос;

	Запрос.Текст =
	"// ======================================================================
	|// PL-данные из документа (1 строка на PL-статью × Подразделение × Документ)
	|ВЫБРАТЬ
	|	ТЧ.Ссылка КАК Документ,
	|	ТЧ.Ссылка.Подразделение КАК Подразделение,
	|	ТЧ.Ссылка.ПодразделениеСтрока КАК ПодразделениеСтрока,
	|	ТЧ.Статья КАК СтатьяPL,
	|	ТЧ.Статья.Группа КАК Группа,
	|	СУММА(ТЧ.СуммаФома1) КАК СуммаФ1,
	|	СУММА(ТЧ.СуммаФорма2) КАК СуммаФ2,
	|	СУММА(ТЧ.Сумма) КАК СуммаPL,
	|	МАКСИМУМ(ВЫРАЗИТЬ(ТЧ.Комментарий КАК Строка(1000))) КАК Комментарий
	|ПОМЕСТИТЬ втPL
	|ИЗ Документ.А_ОтчетPL.ДанныеОтчета КАК ТЧ
	|ГДЕ ТЧ.Ссылка.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|	И НЕ ТЧ.Ссылка.ПометкаУдаления
	|	И ТЧ.Ссылка.ВключатьДочерние = &ВключатьДочерние
	|СГРУППИРОВАТЬ ПО
	|	ТЧ.Ссылка, ТЧ.Ссылка.Подразделение, ТЧ.Ссылка.ПодразделениеСтрока,
	|	ТЧ.Статья, ТЧ.Статья.Группа
	|;
	|
	|// ======================================================================
	|// Связь PL-статья → ДДС (все строки ТЧ Статьи).
	|// Уникальность (одна ДДС в одной PL) гарантирована модулем объекта А_Статьи_PL.
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	СтатьиТЧ.Ссылка КАК СтатьяPL,
	|	СтатьиТЧ.СтатьяДвиженияДенежныхСредств КАК ДДС
	|ПОМЕСТИТЬ втPL_ДДС
	|ИЗ Справочник.А_Статьи_PL.Статьи КАК СтатьиТЧ
	|ГДЕ НЕ СтатьиТЧ.Ссылка.ПометкаУдаления
	|	И СтатьиТЧ.СтатьяДвиженияДенежныхСредств <> ЗНАЧЕНИЕ(Справочник.СтатьиДвиженияДенежныхСредств.ПустаяСсылка)
	|;
	|
	|// ======================================================================
	|// ЕРП-расходы с детализацией до регистратора (как в АнализДоходовРасходов).
	|// Источник: ПрочиеРасходы (первичный регистр всех расходов включая ЗП).
	|// +Контрагент (з шапки документа-регістратора — тільки для основних типів).
	|// +Аналитика (Контрагент / ПодотчетноеЛицо / А_ФизическоеЛицо в зависимости от типа регистратора).
	|// Источник переведён на прямую таблицу регистра (вместо .Обороты), чтобы
	|// иметь доступ к реквизиту А_ФизическоеЛицо для расшифровки ОЗП по ФизЛицу.
	|// Семантика СуммаЕРП = СУММА(Сумма) ТОЛЬКО по ВидДвижения=Приход —
	|// 1-в-1 как было `Р.СуммаПриход` через `.Обороты()`. ВАЖНО: НЕ вычитать Расход,
	|// иначе для подразделений с перераспределением (РаспределениеПрочихЗатрат)
	|// оборот=0, суммы исчезают из PL-отчёта.
	|ВЫБРАТЬ
	|	Р.Подразделение КАК Подразделение,
	|	Р.СтатьяРасходов.А_СтатьяДвиженияДенежныхСредств КАК ДДС,
	|	Р.Регистратор КАК Документ,
	|	ВЫБОР
	|		КОГДА Р.Регистратор ССЫЛКА Документ.ПриобретениеТоваровУслуг
	|			ТОГДА ВЫРАЗИТЬ(Р.Регистратор КАК Документ.ПриобретениеТоваровУслуг).Контрагент
	|		КОГДА Р.Регистратор ССЫЛКА Документ.РасходныйКассовыйОрдер
	|			ТОГДА ВЫРАЗИТЬ(Р.Регистратор КАК Документ.РасходныйКассовыйОрдер).Контрагент
	|		КОГДА Р.Регистратор ССЫЛКА Документ.СписаниеБезналичныхДенежныхСредств
	|			ТОГДА ВЫРАЗИТЬ(Р.Регистратор КАК Документ.СписаниеБезналичныхДенежныхСредств).Контрагент
	|		КОГДА Р.Регистратор ССЫЛКА Документ.АктВыполненныхРабот
	|			ТОГДА ВЫРАЗИТЬ(Р.Регистратор КАК Документ.АктВыполненныхРабот).Контрагент
	|		КОГДА Р.Регистратор ССЫЛКА Документ.ВозвратТоваровПоставщику
	|			ТОГДА ВЫРАЗИТЬ(Р.Регистратор КАК Документ.ВозвратТоваровПоставщику).Контрагент
	|		КОГДА Р.Регистратор ССЫЛКА Документ.ПриходныйКассовыйОрдер
	|			ТОГДА ВЫРАЗИТЬ(Р.Регистратор КАК Документ.ПриходныйКассовыйОрдер).Контрагент
	|		КОГДА Р.Регистратор ССЫЛКА Документ.ПоступлениеБезналичныхДенежныхСредств
	|			ТОГДА ВЫРАЗИТЬ(Р.Регистратор КАК Документ.ПоступлениеБезналичныхДенежныхСредств).Контрагент
	|		КОГДА Р.Регистратор ССЫЛКА Документ.ВозвратТоваровОтКлиента
	|			ТОГДА ВЫРАЗИТЬ(Р.Регистратор КАК Документ.ВозвратТоваровОтКлиента).Контрагент
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|	КОНЕЦ КАК Контрагент,
	|	ВЫБОР
	|		КОГДА Р.Регистратор ССЫЛКА Документ.АвансовыйОтчет
	|			ТОГДА ВЫРАЗИТЬ(Р.Регистратор КАК Документ.АвансовыйОтчет).ПодотчетноеЛицо
	|		КОГДА Р.Регистратор ССЫЛКА Документ.ОтражениеЗарплатыВФинансовомУчете
	|			ТОГДА Р.А_ФизическоеЛицо
	|		КОГДА Р.Регистратор ССЫЛКА Документ.ПриобретениеТоваровУслуг
	|			ТОГДА ВЫРАЗИТЬ(Р.Регистратор КАК Документ.ПриобретениеТоваровУслуг).Контрагент
	|		КОГДА Р.Регистратор ССЫЛКА Документ.РасходныйКассовыйОрдер
	|			ТОГДА ВЫРАЗИТЬ(Р.Регистратор КАК Документ.РасходныйКассовыйОрдер).Контрагент
	|		КОГДА Р.Регистратор ССЫЛКА Документ.СписаниеБезналичныхДенежныхСредств
	|			ТОГДА ВЫРАЗИТЬ(Р.Регистратор КАК Документ.СписаниеБезналичныхДенежныхСредств).Контрагент
	|		КОГДА Р.Регистратор ССЫЛКА Документ.АктВыполненныхРабот
	|			ТОГДА ВЫРАЗИТЬ(Р.Регистратор КАК Документ.АктВыполненныхРабот).Контрагент
	|		КОГДА Р.Регистратор ССЫЛКА Документ.ВозвратТоваровПоставщику
	|			ТОГДА ВЫРАЗИТЬ(Р.Регистратор КАК Документ.ВозвратТоваровПоставщику).Контрагент
	|		КОГДА Р.Регистратор ССЫЛКА Документ.ПриходныйКассовыйОрдер
	|			ТОГДА ВЫРАЗИТЬ(Р.Регистратор КАК Документ.ПриходныйКассовыйОрдер).Контрагент
	|		КОГДА Р.Регистратор ССЫЛКА Документ.ПоступлениеБезналичныхДенежныхСредств
	|			ТОГДА ВЫРАЗИТЬ(Р.Регистратор КАК Документ.ПоступлениеБезналичныхДенежныхСредств).Контрагент
	|		КОГДА Р.Регистратор ССЫЛКА Документ.ВозвратТоваровОтКлиента
	|			ТОГДА ВЫРАЗИТЬ(Р.Регистратор КАК Документ.ВозвратТоваровОтКлиента).Контрагент
	|		ИНАЧЕ NULL
	|	КОНЕЦ КАК Аналитика,
	|	СУММА(Р.Сумма) КАК СуммаЕРП,
	|	СУММА(ВЫБОР КОГДА Р.ФормаPL = ЗНАЧЕНИЕ(Перечисление.А_ФормыPL.Форма2) ТОГДА 0 ИНАЧЕ Р.Сумма КОНЕЦ) КАК СуммаЕРПФ1,
	|	СУММА(ВЫБОР КОГДА Р.ФормаPL = ЗНАЧЕНИЕ(Перечисление.А_ФормыPL.Форма2) ТОГДА Р.Сумма ИНАЧЕ 0 КОНЕЦ) КАК СуммаЕРПФ2
	|ПОМЕСТИТЬ втЕРП_Расх_Детали
	|ИЗ РегистрНакопления.ПрочиеРасходы КАК Р
	|ГДЕ Р.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|	И Р.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|	И Р.СтатьяРасходов <> ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.ПустаяСсылка)
	|	И Р.СтатьяРасходов.А_СтатьяДвиженияДенежныхСредств <> ЗНАЧЕНИЕ(Справочник.СтатьиДвиженияДенежныхСредств.ПустаяСсылка)
	|СГРУППИРОВАТЬ ПО
	|	Р.Подразделение, Р.СтатьяРасходов.А_СтатьяДвиженияДенежныхСредств, Р.Регистратор,
	|	ВЫБОР
	|		КОГДА Р.Регистратор ССЫЛКА Документ.ПриобретениеТоваровУслуг
	|			ТОГДА ВЫРАЗИТЬ(Р.Регистратор КАК Документ.ПриобретениеТоваровУслуг).Контрагент
	|		КОГДА Р.Регистратор ССЫЛКА Документ.РасходныйКассовыйОрдер
	|			ТОГДА ВЫРАЗИТЬ(Р.Регистратор КАК Документ.РасходныйКассовыйОрдер).Контрагент
	|		КОГДА Р.Регистратор ССЫЛКА Документ.СписаниеБезналичныхДенежныхСредств
	|			ТОГДА ВЫРАЗИТЬ(Р.Регистратор КАК Документ.СписаниеБезналичныхДенежныхСредств).Контрагент
	|		КОГДА Р.Регистратор ССЫЛКА Документ.АктВыполненныхРабот
	|			ТОГДА ВЫРАЗИТЬ(Р.Регистратор КАК Документ.АктВыполненныхРабот).Контрагент
	|		КОГДА Р.Регистратор ССЫЛКА Документ.ВозвратТоваровПоставщику
	|			ТОГДА ВЫРАЗИТЬ(Р.Регистратор КАК Документ.ВозвратТоваровПоставщику).Контрагент
	|		КОГДА Р.Регистратор ССЫЛКА Документ.ПриходныйКассовыйОрдер
	|			ТОГДА ВЫРАЗИТЬ(Р.Регистратор КАК Документ.ПриходныйКассовыйОрдер).Контрагент
	|		КОГДА Р.Регистратор ССЫЛКА Документ.ПоступлениеБезналичныхДенежныхСредств
	|			ТОГДА ВЫРАЗИТЬ(Р.Регистратор КАК Документ.ПоступлениеБезналичныхДенежныхСредств).Контрагент
	|		КОГДА Р.Регистратор ССЫЛКА Документ.ВозвратТоваровОтКлиента
	|			ТОГДА ВЫРАЗИТЬ(Р.Регистратор КАК Документ.ВозвратТоваровОтКлиента).Контрагент
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА Р.Регистратор ССЫЛКА Документ.АвансовыйОтчет
	|			ТОГДА ВЫРАЗИТЬ(Р.Регистратор КАК Документ.АвансовыйОтчет).ПодотчетноеЛицо
	|		КОГДА Р.Регистратор ССЫЛКА Документ.ОтражениеЗарплатыВФинансовомУчете
	|			ТОГДА Р.А_ФизическоеЛицо
	|		КОГДА Р.Регистратор ССЫЛКА Документ.ПриобретениеТоваровУслуг
	|			ТОГДА ВЫРАЗИТЬ(Р.Регистратор КАК Документ.ПриобретениеТоваровУслуг).Контрагент
	|		КОГДА Р.Регистратор ССЫЛКА Документ.РасходныйКассовыйОрдер
	|			ТОГДА ВЫРАЗИТЬ(Р.Регистратор КАК Документ.РасходныйКассовыйОрдер).Контрагент
	|		КОГДА Р.Регистратор ССЫЛКА Документ.СписаниеБезналичныхДенежныхСредств
	|			ТОГДА ВЫРАЗИТЬ(Р.Регистратор КАК Документ.СписаниеБезналичныхДенежныхСредств).Контрагент
	|		КОГДА Р.Регистратор ССЫЛКА Документ.АктВыполненныхРабот
	|			ТОГДА ВЫРАЗИТЬ(Р.Регистратор КАК Документ.АктВыполненныхРабот).Контрагент
	|		КОГДА Р.Регистратор ССЫЛКА Документ.ВозвратТоваровПоставщику
	|			ТОГДА ВЫРАЗИТЬ(Р.Регистратор КАК Документ.ВозвратТоваровПоставщику).Контрагент
	|		КОГДА Р.Регистратор ССЫЛКА Документ.ПриходныйКассовыйОрдер
	|			ТОГДА ВЫРАЗИТЬ(Р.Регистратор КАК Документ.ПриходныйКассовыйОрдер).Контрагент
	|		КОГДА Р.Регистратор ССЫЛКА Документ.ПоступлениеБезналичныхДенежныхСредств
	|			ТОГДА ВЫРАЗИТЬ(Р.Регистратор КАК Документ.ПоступлениеБезналичныхДенежныхСредств).Контрагент
	|		КОГДА Р.Регистратор ССЫЛКА Документ.ВозвратТоваровОтКлиента
	|			ТОГДА ВЫРАЗИТЬ(Р.Регистратор КАК Документ.ВозвратТоваровОтКлиента).Контрагент
	|		ИНАЧЕ NULL
	|	КОНЕЦ
	|;
	|
	|// ЕРП-доходы з деталізацією до регістратора + Контрагент (з шапки).
	|// Источники (после правки 2026-04-25):
	|//   - ВыручкаИСебестоимостьПродаж (Виручка з Реалізацій, СтатьяДоходов хардкод)
	|//   - ПрочиеДоходы (Курсові, фін.діяльність — без змін)
	|ВЫБРАТЬ
	|	Д.Подразделение КАК Подразделение,
	|	Д.СтатьяДоходов КАК СтатьяДоходов,
	|	Д.Регистратор КАК Документ,
	|	ВЫБОР
	|		КОГДА Д.Регистратор ССЫЛКА Документ.РеализацияТоваровУслуг
	|			ТОГДА ВЫРАЗИТЬ(Д.Регистратор КАК Документ.РеализацияТоваровУслуг).Контрагент
	|		КОГДА Д.Регистратор ССЫЛКА Документ.ПоступлениеБезналичныхДенежныхСредств
	|			ТОГДА ВЫРАЗИТЬ(Д.Регистратор КАК Документ.ПоступлениеБезналичныхДенежныхСредств).Контрагент
	|		КОГДА Д.Регистратор ССЫЛКА Документ.ПриходныйКассовыйОрдер
	|			ТОГДА ВЫРАЗИТЬ(Д.Регистратор КАК Документ.ПриходныйКассовыйОрдер).Контрагент
	|		КОГДА Д.Регистратор ССЫЛКА Документ.АктВыполненныхРабот
	|			ТОГДА ВЫРАЗИТЬ(Д.Регистратор КАК Документ.АктВыполненныхРабот).Контрагент
	|		КОГДА Д.Регистратор ССЫЛКА Документ.ВозвратТоваровОтКлиента
	|			ТОГДА ВЫРАЗИТЬ(Д.Регистратор КАК Документ.ВозвратТоваровОтКлиента).Контрагент
	|		КОГДА Д.Регистратор ССЫЛКА Документ.ВозвратТоваровПоставщику
	|			ТОГДА ВЫРАЗИТЬ(Д.Регистратор КАК Документ.ВозвратТоваровПоставщику).Контрагент
	|		КОГДА Д.Регистратор ССЫЛКА Документ.КорректировкаРеализации
	|			ТОГДА ВЫРАЗИТЬ(Д.Регистратор КАК Документ.КорректировкаРеализации).Контрагент
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|	КОНЕЦ КАК Контрагент,
	|	СУММА(Д.СуммаДох) КАК СуммаЕРП
	|ПОМЕСТИТЬ втЕРП_Доходы_Детали
	|ИЗ (
	|	ВЫБРАТЬ
	|		Выр.Подразделение КАК Подразделение,
	|		ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиДоходов.ВыручкаОтПродаж) КАК СтатьяДоходов,
	|		Выр.Регистратор КАК Регистратор,
	|		Выр.СуммаВыручки КАК СуммаДох
	|	ИЗ РегистрНакопления.ВыручкаИСебестоимостьПродаж КАК Выр
	|	ГДЕ Выр.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|		И Выр.Активность
	|		И Выр.СуммаВыручки <> 0
	|
	|	ОБЪЕДИНИТЬ ВСЕ
	|
	|	ВЫБРАТЬ П.Подразделение, П.СтатьяДоходов, П.Регистратор, П.СуммаПриход
	|	ИЗ РегистрНакопления.ПрочиеДоходы.Обороты(&НачалоПериода, &КонецПериода, Регистратор, ) КАК П
	|	ГДЕ П.СтатьяДоходов <> ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиДоходов.ПустаяСсылка)
	|) КАК Д
	|СГРУППИРОВАТЬ ПО Д.Подразделение, Д.СтатьяДоходов, Д.Регистратор,
	|	ВЫБОР
	|		КОГДА Д.Регистратор ССЫЛКА Документ.РеализацияТоваровУслуг
	|			ТОГДА ВЫРАЗИТЬ(Д.Регистратор КАК Документ.РеализацияТоваровУслуг).Контрагент
	|		КОГДА Д.Регистратор ССЫЛКА Документ.ПоступлениеБезналичныхДенежныхСредств
	|			ТОГДА ВЫРАЗИТЬ(Д.Регистратор КАК Документ.ПоступлениеБезналичныхДенежныхСредств).Контрагент
	|		КОГДА Д.Регистратор ССЫЛКА Документ.ПриходныйКассовыйОрдер
	|			ТОГДА ВЫРАЗИТЬ(Д.Регистратор КАК Документ.ПриходныйКассовыйОрдер).Контрагент
	|		КОГДА Д.Регистратор ССЫЛКА Документ.АктВыполненныхРабот
	|			ТОГДА ВЫРАЗИТЬ(Д.Регистратор КАК Документ.АктВыполненныхРабот).Контрагент
	|		КОГДА Д.Регистратор ССЫЛКА Документ.ВозвратТоваровОтКлиента
	|			ТОГДА ВЫРАЗИТЬ(Д.Регистратор КАК Документ.ВозвратТоваровОтКлиента).Контрагент
	|		КОГДА Д.Регистратор ССЫЛКА Документ.ВозвратТоваровПоставщику
	|			ТОГДА ВЫРАЗИТЬ(Д.Регистратор КАК Документ.ВозвратТоваровПоставщику).Контрагент
	|		КОГДА Д.Регистратор ССЫЛКА Документ.КорректировкаРеализации
	|			ТОГДА ВЫРАЗИТЬ(Д.Регистратор КАК Документ.КорректировкаРеализации).Контрагент
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|	КОНЕЦ
	|;
	|
	|// ======================================================================
	|// ЕРП-CoGS: суми Себестоимости з ВыручкаИСебестоимостьПродаж,
	|// прив'язані до 1 спецДДС (флаг А_ПриёмникСебестоимостиПродажPL).
	|// Якщо &ДДСCoGS = ПустаяСсылка → 0 рядків (CoGS не з'являється у звіті).
	|ВЫБРАТЬ
	|	Выр.Подразделение КАК Подразделение,
	|	&ДДСCoGS КАК ДДС,
	|	Выр.Регистратор КАК Документ,
	|	ВЫБОР
	|		КОГДА Выр.Регистратор ССЫЛКА Документ.РеализацияТоваровУслуг
	|			ТОГДА ВЫРАЗИТЬ(Выр.Регистратор КАК Документ.РеализацияТоваровУслуг).Контрагент
	|		КОГДА Выр.Регистратор ССЫЛКА Документ.АктВыполненныхРабот
	|			ТОГДА ВЫРАЗИТЬ(Выр.Регистратор КАК Документ.АктВыполненныхРабот).Контрагент
	|		КОГДА Выр.Регистратор ССЫЛКА Документ.ВозвратТоваровОтКлиента
	|			ТОГДА ВЫРАЗИТЬ(Выр.Регистратор КАК Документ.ВозвратТоваровОтКлиента).Контрагент
	|		КОГДА Выр.Регистратор ССЫЛКА Документ.КорректировкаРеализации
	|			ТОГДА ВЫРАЗИТЬ(Выр.Регистратор КАК Документ.КорректировкаРеализации).Контрагент
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|	КОНЕЦ КАК Контрагент,
	|	СУММА(Выр.Стоимость) КАК СуммаЕРП
	|ПОМЕСТИТЬ втЕРП_CoGS_Детали
	|ИЗ РегистрНакопления.ВыручкаИСебестоимостьПродаж КАК Выр
	|ГДЕ Выр.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|	И Выр.Активность
	|	И Выр.Стоимость <> 0
	|	И &ДДСCoGS <> ЗНАЧЕНИЕ(Справочник.СтатьиДвиженияДенежныхСредств.ПустаяСсылка)
	|СГРУППИРОВАТЬ ПО Выр.Подразделение, Выр.Регистратор,
	|	ВЫБОР
	|		КОГДА Выр.Регистратор ССЫЛКА Документ.РеализацияТоваровУслуг
	|			ТОГДА ВЫРАЗИТЬ(Выр.Регистратор КАК Документ.РеализацияТоваровУслуг).Контрагент
	|		КОГДА Выр.Регистратор ССЫЛКА Документ.АктВыполненныхРабот
	|			ТОГДА ВЫРАЗИТЬ(Выр.Регистратор КАК Документ.АктВыполненныхРабот).Контрагент
	|		КОГДА Выр.Регистратор ССЫЛКА Документ.ВозвратТоваровОтКлиента
	|			ТОГДА ВЫРАЗИТЬ(Выр.Регистратор КАК Документ.ВозвратТоваровОтКлиента).Контрагент
	|		КОГДА Выр.Регистратор ССЫЛКА Документ.КорректировкаРеализации
	|			ТОГДА ВЫРАЗИТЬ(Выр.Регистратор КАК Документ.КорректировкаРеализации).Контрагент
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|	КОНЕЦ
	|;
	|
	|// ======================================================================
	|// КАСА (довідка): обороти регістра А_ДвиженияДенегИзКазны згруповані до (Подразделение, ДДС, Документ, Контрагент).
	|// Контрагент з шапки документа парного ERP (через ДокументДвиженияКазны — складений з 5 типів + самопосилання на Перенос).
	|ВЫБРАТЬ
	|	Каз.Подразделение                                                            КАК Подразделение,
	|	Каз.СтатьяДвиженияДенежныхСредств                                            КАК ДДС,
	|	Каз.ДокументДвиженияКазны                                                    КАК Документ,
	|	ВЫБОР
	|		КОГДА Каз.ДокументДвиженияКазны ССЫЛКА Документ.ПриходныйКассовыйОрдер
	|			ТОГДА ВЫРАЗИТЬ(Каз.ДокументДвиженияКазны КАК Документ.ПриходныйКассовыйОрдер).Контрагент
	|		КОГДА Каз.ДокументДвиженияКазны ССЫЛКА Документ.РасходныйКассовыйОрдер
	|			ТОГДА ВЫРАЗИТЬ(Каз.ДокументДвиженияКазны КАК Документ.РасходныйКассовыйОрдер).Контрагент
	|		КОГДА Каз.ДокументДвиженияКазны ССЫЛКА Документ.ПоступлениеБезналичныхДенежныхСредств
	|			ТОГДА ВЫРАЗИТЬ(Каз.ДокументДвиженияКазны КАК Документ.ПоступлениеБезналичныхДенежныхСредств).Контрагент
	|		КОГДА Каз.ДокументДвиженияКазны ССЫЛКА Документ.СписаниеБезналичныхДенежныхСредств
	|			ТОГДА ВЫРАЗИТЬ(Каз.ДокументДвиженияКазны КАК Документ.СписаниеБезналичныхДенежныхСредств).Контрагент
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|	КОНЕЦ                                                                        КАК Контрагент,
	|	СУММА(ВЫБОР КОГДА Каз.СуммаОборот < 0 ТОГДА -Каз.СуммаОборот ИНАЧЕ 0 КОНЕЦ)  КАК СуммаКазнаРасход,
	|	СУММА(ВЫБОР КОГДА Каз.СуммаОборот > 0 ТОГДА  Каз.СуммаОборот ИНАЧЕ 0 КОНЕЦ)  КАК СуммаКазнаПриход
	|ПОМЕСТИТЬ втКазна_ПоПодрДДС
	|ИЗ РегистрНакопления.А_ДвиженияДенегИзКазны.Обороты(&НачалоПериода, &КонецПериода, , ) КАК Каз
	|ГДЕ Каз.СтатьяДвиженияДенежныхСредств <> ЗНАЧЕНИЕ(Справочник.СтатьиДвиженияДенежныхСредств.ПустаяСсылка)
	|СГРУППИРОВАТЬ ПО Каз.Подразделение, Каз.СтатьяДвиженияДенежныхСредств, Каз.ДокументДвиженияКазны,
	|	ВЫБОР
	|		КОГДА Каз.ДокументДвиженияКазны ССЫЛКА Документ.ПриходныйКассовыйОрдер
	|			ТОГДА ВЫРАЗИТЬ(Каз.ДокументДвиженияКазны КАК Документ.ПриходныйКассовыйОрдер).Контрагент
	|		КОГДА Каз.ДокументДвиженияКазны ССЫЛКА Документ.РасходныйКассовыйОрдер
	|			ТОГДА ВЫРАЗИТЬ(Каз.ДокументДвиженияКазны КАК Документ.РасходныйКассовыйОрдер).Контрагент
	|		КОГДА Каз.ДокументДвиженияКазны ССЫЛКА Документ.ПоступлениеБезналичныхДенежныхСредств
	|			ТОГДА ВЫРАЗИТЬ(Каз.ДокументДвиженияКазны КАК Документ.ПоступлениеБезналичныхДенежныхСредств).Контрагент
	|		КОГДА Каз.ДокументДвиженияКазны ССЫЛКА Документ.СписаниеБезналичныхДенежныхСредств
	|			ТОГДА ВЫРАЗИТЬ(Каз.ДокументДвиженияКазны КАК Документ.СписаниеБезналичныхДенежныхСредств).Контрагент
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|	КОНЕЦ
	|;
	|
	|// ======================================================================
	|// Строки PL: держат PL-суммы, ЕРП=0 (ЕРП заполняется деталями ниже).
	|ВЫБРАТЬ
	|	PL.Подразделение КАК Подразделение,
	|	PL.Подразделение.А_НаправлениеДеятельности КАК НаправлениеДеятельности,
	|	PL.ПодразделениеСтрока КАК ПодразделениеСтрока,
	|	PL.Группа КАК Группа,
	|	PL.СтатьяPL КАК СтатьяPL,
	|	NULL КАК ДДС,
	|	PL.СуммаФ1 КАК СуммаФ1,
	|	PL.СуммаФ2 КАК СуммаФ2,
	|	PL.СуммаPL КАК СуммаPL,
	|	0 КАК СуммаЕРП,
	|	PL.СуммаPL КАК Разница,
	|	PL.Документ КАК Документ,
	|	PL.Комментарий КАК Комментарий,
	|	0 КАК СуммаДДСизКазныРасход,
	|	0 КАК СуммаДДСизКазныПриход,
	|	ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка) КАК Контрагент,
	|	NULL КАК Аналитика,
	|	0 КАК СуммаЕРПФ1,
	|	0 КАК СуммаЕРПФ2,
	|	PL.СуммаФ1 КАК РазницаФ1,
	|	PL.СуммаФ2 КАК РазницаФ2
	|ПОМЕСТИТЬ втPL_Строки
	|ИЗ втPL КАК PL
	|;
	|
	|// ======================================================================
	|// ЕРП-детали расходов, привязанные к PL через ДДС.
	|// (Подразделение, СтатьяPL, ДДС, Регистратор) — одна строка.
	|ВЫБРАТЬ
	|	ЕРПР.Подразделение КАК Подразделение,
	|	ЕРПР.Подразделение.А_НаправлениеДеятельности КАК НаправлениеДеятельности,
	|	ВЫРАЗИТЬ("""" КАК Строка(150)) КАК ПодразделениеСтрока,
	|	PLДДС.СтатьяPL.Группа КАК Группа,
	|	PLДДС.СтатьяPL КАК СтатьяPL,
	|	ЕРПР.ДДС КАК ДДС,
	|	0 КАК СуммаФ1,
	|	0 КАК СуммаФ2,
	|	0 КАК СуммаPL,
	|	ЕРПР.СуммаЕРП КАК СуммаЕРП,
	|	-ЕРПР.СуммаЕРП КАК Разница,
	|	ЕРПР.Документ КАК Документ,
	|	ВЫРАЗИТЬ("""" КАК Строка(1000)) КАК Комментарий,
	|	0 КАК СуммаДДСизКазныРасход,
	|	0 КАК СуммаДДСизКазныПриход,
	|	ЕРПР.Контрагент КАК Контрагент,
	|	ЕРПР.Аналитика КАК Аналитика,
	|	ЕРПР.СуммаЕРПФ1 КАК СуммаЕРПФ1,
	|	ЕРПР.СуммаЕРПФ2 КАК СуммаЕРПФ2,
	|	-ЕРПР.СуммаЕРПФ1 КАК РазницаФ1,
	|	-ЕРПР.СуммаЕРПФ2 КАК РазницаФ2
	|ПОМЕСТИТЬ втЕРП_ПоPL_Расх
	|ИЗ втЕРП_Расх_Детали КАК ЕРПР
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ втPL_ДДС КАК PLДДС ПО PLДДС.ДДС = ЕРПР.ДДС
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЕРПР.Подразделение КАК Подразделение,
	|	ЕРПР.Подразделение.А_НаправлениеДеятельности КАК НаправлениеДеятельности,
	|	ВЫРАЗИТЬ("""" КАК Строка(150)) КАК ПодразделениеСтрока,
	|	PLДДС.СтатьяPL.Группа КАК Группа,
	|	PLДДС.СтатьяPL КАК СтатьяPL,
	|	ЕРПР.ДДС КАК ДДС,
	|	0 КАК СуммаФ1,
	|	0 КАК СуммаФ2,
	|	0 КАК СуммаPL,
	|	ЕРПР.СуммаЕРП КАК СуммаЕРП,
	|	-ЕРПР.СуммаЕРП КАК Разница,
	|	ЕРПР.Документ КАК Документ,
	|	ВЫРАЗИТЬ("""" КАК Строка(1000)) КАК Комментарий,
	|	0 КАК СуммаДДСизКазныРасход,
	|	0 КАК СуммаДДСизКазныПриход,
	|	ЕРПР.Контрагент КАК Контрагент,
	|	ЕРПР.Контрагент КАК Аналитика,
	|	ЕРПР.СуммаЕРП,
	|	0,
	|	-ЕРПР.СуммаЕРП,
	|	0
	|ИЗ втЕРП_CoGS_Детали КАК ЕРПР
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ втPL_ДДС КАК PLДДС ПО PLДДС.ДДС = ЕРПР.ДДС
	|;
	|
	|// ЕРП-детали доходов, привязанные к PL через СтатьяДоходов из справочника А_Статьи_PL.
	|ВЫБРАТЬ
	|	ЕРПД.Подразделение КАК Подразделение,
	|	ЕРПД.Подразделение.А_НаправлениеДеятельности КАК НаправлениеДеятельности,
	|	ВЫРАЗИТЬ("""" КАК Строка(150)) КАК ПодразделениеСтрока,
	|	PLДДС.СтатьяPL.Группа КАК Группа,
	|	PLДДС.СтатьяPL КАК СтатьяPL,
	|	PLДДС.ДДС КАК ДДС,
	|	0 КАК СуммаФ1,
	|	0 КАК СуммаФ2,
	|	0 КАК СуммаPL,
	|	СУММА(ЕРПД.СуммаЕРП) КАК СуммаЕРП,
	|	-СУММА(ЕРПД.СуммаЕРП) КАК Разница,
	|	ЕРПД.Документ КАК Документ,
	|	ВЫРАЗИТЬ("""" КАК Строка(1000)) КАК Комментарий,
	|	0 КАК СуммаДДСизКазныРасход,
	|	0 КАК СуммаДДСизКазныПриход,
	|	ЕРПД.Контрагент КАК Контрагент,
	|	ЕРПД.Контрагент КАК Аналитика,
	|	СУММА(ЕРПД.СуммаЕРП) КАК СуммаЕРПФ1,
	|	0 КАК СуммаЕРПФ2,
	|	-СУММА(ЕРПД.СуммаЕРП) КАК РазницаФ1,
	|	0 КАК РазницаФ2
	|ПОМЕСТИТЬ втЕРП_ПоPL_Доходы
	|ИЗ втЕРП_Доходы_Детали КАК ЕРПД
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ втPL_ДДС КАК PLДДС
	|		ПО PLДДС.ДДС = ЕРПД.СтатьяДоходов.А_СтатьяДвиженияДенежныхСредств
	|СГРУППИРОВАТЬ ПО
	|	ЕРПД.Подразделение, ЕРПД.Подразделение.А_НаправлениеДеятельности,
	|	PLДДС.СтатьяPL, PLДДС.СтатьяPL.Группа, PLДДС.ДДС, ЕРПД.Документ, ЕРПД.Контрагент
	|;
	|
	|// ======================================================================
	|// ЕРП без PL: ДДС/СтатьяДоходов не привязаны ни к одной А_Статьи_PL (аномалия).
	|ВЫБРАТЬ
	|	ЕРПР.Подразделение,
	|	ЕРПР.Подразделение.А_НаправлениеДеятельности,
	|	ВЫРАЗИТЬ("""" КАК Строка(150)),
	|	NULL, NULL,
	|	ЕРПР.ДДС,
	|	0, 0, 0,
	|	ЕРПР.СуммаЕРП,
	|	-ЕРПР.СуммаЕРП,
	|	ЕРПР.Документ,
	|	ВЫРАЗИТЬ("""" КАК Строка(1000)),
	|	0,
	|	0,
	|	ЕРПР.Контрагент,
	|	ЕРПР.Аналитика,
	|	ЕРПР.СуммаЕРПФ1,
	|	ЕРПР.СуммаЕРПФ2,
	|	-ЕРПР.СуммаЕРПФ1,
	|	-ЕРПР.СуммаЕРПФ2
	|ПОМЕСТИТЬ втЕРП_БезPL_Расх
	|ИЗ втЕРП_Расх_Детали КАК ЕРПР
	|ГДЕ НЕ ЕРПР.ДДС В (ВЫБРАТЬ PLД.ДДС ИЗ втPL_ДДС КАК PLД)
	|;
	|
	|ВЫБРАТЬ
	|	ЕРПД.Подразделение,
	|	ЕРПД.Подразделение.А_НаправлениеДеятельности,
	|	ВЫРАЗИТЬ("""" КАК Строка(150)),
	|	NULL, NULL, NULL,
	|	0, 0, 0,
	|	ЕРПД.СуммаЕРП,
	|	-ЕРПД.СуммаЕРП,
	|	ЕРПД.Документ,
	|	ВЫРАЗИТЬ("""" КАК Строка(1000)),
	|	0,
	|	0,
	|	ЕРПД.Контрагент,
	|	ЕРПД.Контрагент,
	|	ЕРПД.СуммаЕРП,
	|	0,
	|	-ЕРПД.СуммаЕРП,
	|	0
	|ПОМЕСТИТЬ втЕРП_БезPL_Доход
	|ИЗ втЕРП_Доходы_Детали КАК ЕРПД
	|ГДЕ НЕ ЕРПД.СтатьяДоходов.А_СтатьяДвиженияДенежныхСредств В
	|	(ВЫБРАТЬ PLД.ДДС ИЗ втPL_ДДС КАК PLД)
	|;
	|
	|// ======================================================================
	|// Каса прив'язана до PL через ДДС (довідка для фінансиста — касовий метод)
	|// Документ — поле з регістра (парний ERP-документ або сам Перенос рухів з Казни)
	|ВЫБРАТЬ
	|	К.Подразделение                                                              КАК Подразделение,
	|	К.Подразделение.А_НаправлениеДеятельности                                    КАК НаправлениеДеятельности,
	|	ВЫРАЗИТЬ("""" КАК Строка(150))                                               КАК ПодразделениеСтрока,
	|	PLДДС.СтатьяPL.Группа                                                        КАК Группа,
	|	PLДДС.СтатьяPL                                                               КАК СтатьяPL,
	|	К.ДДС                                                                        КАК ДДС,
	|	0 КАК СуммаФ1, 0 КАК СуммаФ2, 0 КАК СуммаPL,
	|	0 КАК СуммаЕРП, 0 КАК Разница,
	|	К.Документ                                                                   КАК Документ,
	|	ВЫРАЗИТЬ("""" КАК Строка(1000))                                              КАК Комментарий,
	|	К.СуммаКазнаРасход                                                           КАК СуммаДДСизКазныРасход,
	|	К.СуммаКазнаПриход                                                           КАК СуммаДДСизКазныПриход,
	|	К.Контрагент                                                                 КАК Контрагент,
	|	К.Контрагент                                                                 КАК Аналитика,
	|	0 КАК СуммаЕРПФ1,
	|	0 КАК СуммаЕРПФ2,
	|	0 КАК РазницаФ1,
	|	0 КАК РазницаФ2
	|ПОМЕСТИТЬ втКазна_ПоPL
	|ИЗ втКазна_ПоПодрДДС КАК К
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ втPL_ДДС КАК PLДДС ПО PLДДС.ДДС = К.ДДС
	|;
	|
	|// Каса БЕЗ зв'язку з PL (внутрішньогрупові, транзит — для повноти аналітики)
	|ВЫБРАТЬ
	|	К.Подразделение,
	|	К.Подразделение.А_НаправлениеДеятельности,
	|	ВЫРАЗИТЬ("""" КАК Строка(150)),
	|	NULL,
	|	NULL,
	|	К.ДДС,
	|	0, 0, 0, 0, 0,
	|	К.Документ,
	|	ВЫРАЗИТЬ("""" КАК Строка(1000)),
	|	К.СуммаКазнаРасход,
	|	К.СуммаКазнаПриход,
	|	К.Контрагент,
	|	К.Контрагент,
	|	0,
	|	0,
	|	0,
	|	0
	|ПОМЕСТИТЬ втКазна_БезPL
	|ИЗ втКазна_ПоПодрДДС КАК К
	|ГДЕ НЕ К.ДДС В (ВЫБРАТЬ PLД.ДДС ИЗ втPL_ДДС КАК PLД)
	|;
	|
	|// ======================================================================
	|// Финальное объединение
	|ВЫБРАТЬ * ИЗ втPL_Строки      ГДЕ &ПоказPL
	|ОБЪЕДИНИТЬ ВСЕ
	|ВЫБРАТЬ * ИЗ втЕРП_ПоPL_Расх  ГДЕ &ПоказЕРП
	|ОБЪЕДИНИТЬ ВСЕ
	|ВЫБРАТЬ * ИЗ втЕРП_ПоPL_Доходы ГДЕ &ПоказЕРП
	|ОБЪЕДИНИТЬ ВСЕ
	|ВЫБРАТЬ * ИЗ втЕРП_БезPL_Расх ГДЕ &ПоказЕРП
	|ОБЪЕДИНИТЬ ВСЕ
	|ВЫБРАТЬ * ИЗ втЕРП_БезPL_Доход ГДЕ &ПоказЕРП
	|ОБЪЕДИНИТЬ ВСЕ
	|ВЫБРАТЬ * ИЗ втКазна_ПоPL    ГДЕ &ПоказКазна
	|ОБЪЕДИНИТЬ ВСЕ
	|ВЫБРАТЬ * ИЗ втКазна_БезPL   ГДЕ &ПоказКазна
	|";

	Запрос.УстановитьПараметр("НачалоПериода", НачалоПериода);
	Запрос.УстановитьПараметр("КонецПериода", КонецПериода);
	Запрос.УстановитьПараметр("ВключатьДочерние", ВключатьДочерние);
	Запрос.УстановитьПараметр("ДДСCoGS", ПолучитьДДСПриёмникCoGS());
	Запрос.УстановитьПараметр("ПоказPL", ПоказPL);
	Запрос.УстановитьПараметр("ПоказЕРП", ПоказЕРП);
	Запрос.УстановитьПараметр("ПоказКазна", ПоказКазна);

	Возврат Запрос.Выполнить().Выгрузить();

КонецФункции

#КонецОбласти

#КонецЕсли
